package note;

public class Note1123 {
/*반복문
 * -for : 초기화, 조건식, 증감식
 * -while : 조건식
 * -do while : 조건식, 한번은 무조건 실행됨
 * 
 * 배열
 * -같은 타입의 데이터들을 모아놓은 것
 * -크기 변경이 안됨
 * -배열 초기값
 * 	-정수형 : 0
 * 	-실수형 변수 : 0.0,0.0f
 * 	-참조변수 : null
 * -배열의 복사
 * 	-for문을 이용함
 * 	-System.Arraycopy();,Arrays.copyOf();
 * -참조변수의 복사
 * 	-얕은 복사 
 * 		-주소값을 복사하여 참조를 공유=> 수정하면 함께 값이 변함
 * 	-깊은 복사	
 * 		-해당 값자체를 복사하여 대입,(배열은 각번지에 있는 값, 객체인 경우 필드 복사) =>다른 곳에서 수정해도 영향이 없음.
 * 
 * -배열의 초기화
 * 		-자료형 [] 배열명 = {값1, 값2..... 값n}
 * -배열 사용법
 * 		-배열명[번지]
 * 
 * -메소드 오버로딩
 * 	-매개변수의 갯수가 달라야함	or
 * 	-매개변수의 타입이 달라야함.
 * 	-매소드명이 같아야함
 * 	
 * -ObjectInput/OutputStream
 * 
 * */

}
