package note;

public class Note1117 {
/*람다식
 * - 자바 8부터 지원
 * - 람다 계산법에서 사용된 식을 프로그래밍 언어에 접목하여 *익명 함수*를 생성
 * - 코드가 간결해주며 컬렉션 요소를 필터링 또는 매핑하여 쉽게 집계
 * - 람다식은 함수적 인터페이스의 익명 구현 객체로 취급
 * 
 *  (타입 매개변수,...) ->  {실행문;...}
 * -매개 타입은 런타임시 대입값 따라 자동인식=>생략가능
 * -하나의 매개변수만있을때에는 괄호 생략가능
 * -하나의 실행문만 있다면 중괄호 생략가능
 * -매개변수가 없다면 괄호 생략불가
 * -리턴값이 있는경우 return문 사용
 * -중괄호에 return문만 있을 경우 중괄호 생략가능
 * 
 * 타겟 타입
 * -람다식이 대입되는 인터페이스
 * -익명 구현객체를 만들때 사용할 인터페이스
 * 
 * 함수적 인터페이스
 * - **하나의 추상 메소드가 선언된 인터페이스가 타겟 타입
 * - @FucntionalInterface 어노테이션
 * - 하나의 추상메소드만을 가지는지 컴파일러가체크, 두개이상이 선언되어있다면 컴파일 오류발생
 * */
	
}

