package note;

public class Note1101 {
/* 객체지향언어의 특징
 *  1. 캡슐화(Encapsulation)
 *  2. 상속(Inheritance) + 추상화(Abstraction)
 *  3. 다형성(Polymorphism)
 *  
 *  객체지향언어란?
 *  각각의 객체 간의 상호작용
 *  
 *  자바에서 객체란?
 *  
 *  클래스에 정의된 내용대로 /new 연산자를 통해 /메모리 영역에 생성된것
 * 
 *  클래스란?
 *  객체의 특성(속성, 기능)에 대한 정의를 한 것
 *  
 *  클래스의 등장 배경
 *  변수 -> 1개의 자료형, 1개의 데이터
 *  배열 -> 1개의 자료형, 여러개의 데이터
 *  구조체(객체) -> 여러개의 자료형, 여러개의 데이터
 *  
 *  구조체 + 기능 => 클래스
 *  반드시 추상화와 캡슐화가 적용이 되어야 함.
 *  
 *  추상화 
 *  프로그램에 필요한 / 공통점을 추출 / 불필요한 공통점을 제거/
 *  
 *  캡슐화란?
 *  추상화를 통해 정리된 / 데이터들과 기능을하나로 묶음/
 *  /데이터의 접근 제한을 원칙으로하여/ 클래스 외부의 데이터에 대한 직접접근을 막고
 *  대신 데이터를 처리하는 함수들을 클래스 내부에서 작성 
 *  => 정보 보호를 위하여 데이터 간접접근
 * 
 * 
 */
	
}
