package note;

public class Note1109 {

		/*
		 * 변수
		 * -데이터를 저장하는 물리적인 공간
		 * -변수 선언방법
		 * 자료형 변수명 = 초기값;
		 * -변수명 작성 규칙
		 * -자료형 변환(기본 자료형)
		 * -자동
		 * 	-작은 데이터를 큰 데이터에 저장하는 경우
		 * 	-정수를 실수에 저장하는 경우
		 * 	-자동으로 변환이 일어남
		 * -강제(명시적)
		 * 	-큰 데이터를 작은 데이터에 저장하는 경우, 손실이 발생할 수 있음
		 * 	-자동으로 가능하지만 필요에 의해 강제로 하는 경우가 있다.
		 * 	-값 또는 변수 앞에 (자료형)을 붙여서 형변환을 함
		 * 
		 * 연산자
		 * - 산술 : 정수 / 정수를 조심
		 * - 비교 연산자
		 * 	-==를 =과 혼동하면 안됨
		 * 	-참조변수는 ==를 이용할때 조심. 참조 변수의 ==는 값이 같은 것을 물어보는 것이 아닌 같은 객체를 공유하는지를 물어보는 것
		 * -논리 연산자
		 * 	-조건식이 복잡하면 논리 연산자를 잘못 쓸 수 있음
		 * -증감연산자
		 * -조건선택연산자 : 마음의 여유가 있을때
		 * -대입연산자 : 오른쪽 값을 왼쪽에 저장. 덮어쓰기
		 * 	
		 * 조건문
		 * -~하면 ...한다.
		 * -~ :조건식, :실행문
		 * -SWITCH문
		 * -break문 뺴먹지 말것
		 * -()안에 변수 또는 식을 설정
		 * 
		 * 반복문
		 * -횟수
		 * -무한루프, 실행되지 않는경우
		 * 
		 * 배열
		 * -같은 자료형 데이터들을 모아놓은 것
		 * -반복문을 사용하여 데이터들을 편하게 관리하기 위해서 사용함.
		 * -배열 선언 방법
		 * 자료형 [] 배열명, 자료형 배열명[] = new 자료형 [크기]
		 * -할당된 배열 각 번지는 자료형에 맞는 초기값으로 초기화가 된다.
		 * -시작번지는 0번지, 마지막번지는 크기-1
		 * -배열 arr에 i번지에 있는 값을 접근 : arr[i]
		 * 
		 * */
}
